## **Assignment - 6**

1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014.



```
SELECT *
FROM Worker
WHERE MONTH(Joining_Date) = 2 
AND YEAR(Joining_Date) = 2014

```

2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.



```

SELECT First_Name, 
Last_Name,
Department,
COUNT(*) as 'Count'
FROM Worker
GROUP BY First_Name, Last_Name, Department
HAVING COUNT(*) > 1

```

3. How to remove duplicate rows from Employees table.



```

WITH CTE AS
(SELECT *, ROW_NUMBER() 
	OVER(PARTITION BY First_Name, Last_Name, Department
	ORDER BY (ID)) AS RN
FROM Worker)
DELETE FROM CTE
WHERE RN > 1

```